In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('examples/ex1.csv')

In [3]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [5]:
names=['a', 'b', 'c', 'd', 'message']
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [6]:
parsed = pd.read_csv('examples/csv_mindex.csv', index_col=['key1', 'key2'])

In [7]:
parsed

           value1  value2
key1 key2
one  a          1       2
     a          3       4
     a          5       6
     a          7       8
two  a          9      10
     a         11      12
     a         13      14
     a         15      16

In [9]:
list(open('examples/ext3.txt'))

['       A      B      C\n',
 'aaa  -0.26  -1.02  -0.61\n',
 'bbb  0.92   0.30   -0.02\n',
 'ccc  -0.26  -0.38  -0.21\n',
 'ddd  -0.87  -0.34  1.10']

In [10]:
result = pd.read_csv('examples/ext3.txt', sep='\s+')

In [11]:
result

        A     B     C
aaa -0.26 -1.02 -0.61
bbb  0.92  0.30 -0.02
ccc -0.26 -0.38 -0.21
ddd -0.87 -0.34  1.10

In [12]:
pd.read_csv('examples/ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [15]:
result = pd.read_csv('examples/ex5.csv')

In [16]:
result

  something   a   b     c   d message
0       one   1   2   3.0   4     NaN
1       two   5   6   NaN   8   world
2     three   9  10  11.0  12     foo

In [17]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [18]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])

In [19]:
result

  something   a   b     c   d message
0       one   1   2   3.0   4     NaN
1       two   5   6   NaN   8   world
2     three   9  10  11.0  12     foo

In [20]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [22]:
result = pd.read_csv('examples/ex5.csv', na_values=sentinels)

In [23]:
result

  something   a   b     c   d message
0       one   1   2   3.0   4     NaN
1       NaN   5   6   NaN   8   world
2     three   9  10  11.0  12     NaN